const plantsData=
[
  {
    "id": 0,
    "name": "狙击豌豆（狙）",
    "description": "枪枪爆头，好运连连",
    "features": [
      "0阶：每7秒狙击一次威胁值最高的敌人，伤害200。威胁值计算：\r消失，变黑，秒杀，潜水水下，盲盒，俩巨人，二爷无敌，濒死，选卡矿工，矿工遁地，蹦极下靶\r以上状态狙击不索敌，威胁值每个僵尸单独计算\r僵尸威胁值＝当前本体血量+当前防具血量+1000\r僵尸贴脸+2000，僵尸近距（3.5格）+1000\r近距僵尸状态：\r+1000：\r撑杆有杆\r+2000：\r舞王前摇\r舞王后腰\r梯子拿梯\r窝瓜没死\r二爷暴走\r+4000：\r小丑快炸\r巨人快砸\r梯子快放梯\r撑杆起跳\r矿工换向\r随机8000~11000：\r空中飞鬼\r投车快投\r撑杆跳起来\r潜水露头\r潜水下水\r气球下落\r类型威胁计算：\r精英+4000，精英气球额外+4000\r远程攻击类僵尸+8000\r小鬼，气球，矿工，冰车，二爷，舞王，海豚，撑杆+2000\r威胁值按照1000:1转化为减少CD秒数，减到0.5秒时触发瞬狙，瞬狙攻速0.5秒，CD7~13.5秒内随机\r若瞬狙CD没转好，则改为1秒间隔的攻击\r若威胁值达到8500，则触发无CD瞬狙击，伤害翻倍",
      "1阶（3000经验）:伤害200--300",
      "2阶（9000经验）:血量300--500",
      "3阶（15000经验）:伤害300--400",
      "4阶（24000经验）:血量500--800",
      "5阶（45000经验）:每次狙击10%概率秒杀，对于精英气球秒杀，其他精英怪则造成1w伤害（防爆门等限伤类僵尸可抵挡）",
    ],
  },
  {
    "id": 1,
    "name": "百变大麦（麦）",
    "description": "麦版为什么叫麦版",
    "features": [
      "变身随机植物，随机阶级，不吃经验",
    ],
  },
  {
    "id": 3,
    "name": "坚果（坚）",
    "description": "存护之心",
    "features": [
      "0阶:血量2000，受到碾压伤害时，会扣除2000血",
      "1阶（200经验）:血量2000-3500",
      "2阶（600经验）:血量3500--5000",
      "3阶（1000经验）:血量5000--6500",
      "4阶（1600经验）:血量6500--8000",
      "5阶（3000经验）:获得自回血（200/s），为全队增加一次200血量的护盾，每三分钟重置一次",
    ],
  },
  /*
  {
    "id": 4,
    "name": "土豆雷（雷）",
    "description": "万象天引",
    "features": [
      "0阶：当本行无非盲盒目标时，每10s在全行内随机一格释放瞬爆雷；\r当本行存在非盲盒目标时，雷优先索敌最本行最前方的非盲盒目标，伤害350。\r本体被啃食连残血后出土爆炸，伤害1800（可复活一次）",
      "1阶(750经验)：伤害350→370",
      "2阶(2250经验)：伤害370→400",
      "3阶(7500经验)：伤害400→450",
      "4阶(45000经验)：攻击间隔10s→5s",
      "5阶(100000经验)：瞬爆雷伤害×1.5倍，并吸引瞬爆雷和土豆雷自身左右1.5格范围内的僵尸到瞬爆雷处爆炸。",
    ],
  },*/
  {
    "id":5,
    "name":"寒冰射手（寒）",
    "description": "霜寒离神",
    "features":[
      "0阶：原版攻速。一轮发射1枚子弹，90%发射1颗冰豆；10%概率发射一枚冰锥。\r冰豆：伤害20；为僵尸增加1层寒意。\r冰锥：伤害60；最高穿透5个目标；为有寒意目标增加1层寒意，无寒意目标增加3层寒意。",
      "1阶(3000经验):冰锥概率10%→20%",
      "2阶(9000经验):一轮1枚子弹→2枚",
      "3阶(15000经验):冰锥伤害60→80",
      "4阶(25000经验):冰锥必定冰冻第一个目标；冰锥穿透冰冻目标不消耗穿透次数",
      "5阶(45000经验):冰锥最高穿透5个目标→8个；冰锥会冰冻第三个目标左右半格的僵尸。  ",
    ]
  },
  {
    "id":6,
    "name":"大嘴花（嘴）",
    "description": "蝉在叫,____",
    "features":[
      "0阶：大嘴花可以成长，初始攻击距离140像素(从大嘴格子中心算起，本格0.5格+前方1.25格)，当前方存在僵尸啃咬植物时，额外增加60像素。\r撕咬伤害40，撕咬间隔1.06s。\r受到巨人攻击时，扣除500血；受到冰车碾压时，扣除300血并击退冰车。\r初始0级咀嚼时间同原版，每吃下一次，提升1级，提高血量上限150，攻击距离增加10像素(1格80像素)，咀嚼速度-2s。\r等级上限5级。每消化一次僵尸，回复150血量。\r啃咬无法吞噬的僵尸时一次回复150血。",
      "1阶(1500经验)：撕咬伤害40→60",
      "2阶(4500经验)：等级上限5级→10级",
      "3阶(7500经验)：撕咬伤害60→80",
      "4阶(12000经验)：等级上限10级→18级(满级攻击距离0.5+3.5格，咀嚼时间为6.34s)",
      "5阶(22500经验)：撕咬无法吞噬的僵尸时有5%概率秒杀僵尸(处于无敌状态下的僵尸无法被秒杀)。",
    ]
  },
  {
    "id":28,
    "name":"裂荚射手（裂）",
    "description":"意念豆回归",
    "features":[
      "0阶：前2后2，射速1.5s，一个意念豆，意念豆同S5，碰到僵尸反弹",
      "1阶(3000经验)：意念豆+1",
      "2阶(9000经验)：意念豆击中僵尸10%向左平移一格",
      "3阶(15000经验)：滚木",
      "4阶(25000经验)：意念豆+1",
      "5阶(45000经验)：意念豆有15%概率穿透一个敌人（仅向右）",
    ]
  },
  {
    "id":41,
    "name":"冰冻生菜（菜）",
    "description":"霜华漫天",
    "features":[
      "0阶：每15秒在距离家门最近的一只僵尸脚下生成一枚冰冻生菜，被啃咬时触发，造成单体被冰冻5秒，解冻后附加1层寒意",
      "1阶：15秒加速至14秒 冰冻时间延长至6秒",
      "2阶：14秒加速至13秒 冰冻时间延长至7秒",
      "3阶：13秒加速至12秒 冰冻时间延长至8秒",
      "4阶：12秒加速至11秒 冰冻时间延长至9秒",
      "5阶：11秒加速至10秒 冰冻时间延长至10秒 冰冻对象升为一整格",
    ]
  }
]
