const plantsData=
[
    {
      "id": 0,
      "name": "狙击豌豆",
      "description": "每7秒狙击一次威胁值最高的敌人，伤害200",
      "features": [
        "威胁值计算：\r消失，变黑，秒杀，潜水水下，盲盒，俩巨人，二爷无敌，濒死，选卡矿工，矿工遁地，蹦极下靶\r以上状态狙击不索敌，威胁值每个僵尸单独计算\r僵尸威胁值＝当前本体血量+当前防具血量+1000\r僵尸贴脸+2000，僵尸近距（3.5格）+1000\r近距僵尸状态：\r+1000：\r撑杆有杆\r+2000：\r舞王前摇\r舞王后腰\r梯子拿梯\r窝瓜没死\r二爷暴走\r+4000：\r小丑快炸\r巨人快砸\r梯子快放梯\r撑杆起跳\r矿工换向\r随机8000~11000：\r空中飞鬼\r投车快投\r撑杆跳起来\r潜水露头\r潜水下水\r气球下落\r类型威胁计算：\r精英+4000，精英气球额外+4000\r远程攻击类僵尸+8000\r小鬼，气球，矿工，冰车，二爷，舞王，海豚，撑杆+2000\r威胁值按照1000:1转化为减少CD秒数，减到0.5秒时触发瞬狙，瞬狙攻速0.5秒，CD7~13.5秒内随机\r若瞬狙CD没转好，则改为1秒间隔的攻击\r若威胁值达到8500，则触发无CD瞬狙击，伤害翻倍",
        "1阶:伤害200--300",
        "2阶:血量300--500",
        "3阶:伤害300--400",
        "4阶:血量500--800",
        "5阶:每次狙击10%概率秒杀，对于精英气球秒杀，其他精英怪则造成1w伤害（防爆门等限伤类僵尸可抵挡）",
      ],
    },
    {
      "id": 1,
      "name": "百变大麦",
      "description": "麦版为什么叫麦版",
      "features": [
        "变身随机植物,随机阶级",
      ],
    },
    {
      "id": 3,
      "name": "坚果",
      "description": "需要3000经验满阶，拥有极高的血量",
      "features": [
        "0阶:血量2000，受到碾压伤害时，会扣除2000血",
        "1阶:血量2000-3500",
        "2阶:血量3500--5000",
        "3阶:血量5000--6500",
        "4阶:血量6500--8000",
        "5阶:获得自回血（200/s），为全队增加一次200血量的护盾，每三分钟重置一次",
      ],
    },
]
