const plantsData=
[
  {
    "id": 0,
    "name": "狙击豌豆（狙）",
    "description": "枪枪爆头，好运连连",
    "features": [
      "0阶：每7秒狙击一次威胁值最高的敌人，伤害200。威胁值计算：\r消失，变黑，秒杀，潜水水下，盲盒，俩巨人，二爷无敌，濒死，选卡矿工，矿工遁地，蹦极下靶\r以上状态狙击不索敌，威胁值每个僵尸单独计算\r僵尸威胁值＝当前本体血量+当前防具血量1000\r僵尸贴脸+2000，僵尸近距（3.5格）+1000\r近距僵尸状态：\r+1000：\r撑杆有杆\r+2000：\r舞王前摇\r舞王后腰\r梯子拿梯\r窝瓜没死\r二爷暴走\r+4000：\r小丑快炸\r巨人快砸\r梯子快放梯\r撑杆起跳\r矿工换向\r随机8000~11000：\r空中飞鬼\r投车快投\r撑杆跳起来\r潜水露头\r潜水下水\r气球下落\r类型威胁计算：\r精英+3000，精英气球额外+4000，带门防爆门-3000\r远程攻击类僵尸+8000，气球再+10000\r小鬼，气球，矿工，冰车，二爷，舞王，海豚，撑杆+2000\r威胁值按照1000:1转化为减少CD秒数，减到0.5秒时触发瞬狙，瞬狙攻速0.5秒，CD7~13.5秒内随机\r若瞬狙CD没转好，则改为2.5秒间隔的攻击\r",
      "1阶（3000经验）:伤害200--300",
      "2阶（9000经验）:血量300--500",
      "3阶（15000经验）:伤害300--400",
      "4阶（24000经验）:血量500--800",
      "5阶（45000经验）:每次狙击5%概率秒杀，对于精英气球秒杀，其他精英怪则造成1w伤害（防爆门等限伤类僵尸可抵挡）\r且可以索敌盲盒和巨人，同等概率秒杀，若威胁值达到12000，则触发无CD瞬狙击，伤害翻倍\r5阶后优先索敌坤坤，坤坤优先级大于其他所有僵尸",
    ],
  },
  {
    "id": 1,
    "name": "百变大麦（麦）",
    "description": "麦版为什么叫麦版",
    "features": [
      "变身随机植物，随机阶级，不吃经验",
    ],
  },
  {
    "id": 3,
    "name": "坚果（坚）",
    "description": "存护之心",
    "features": [
      "0阶:血量2000，受到碾压伤害时，会扣除2000血",
      "1阶（200经验）:血量2000-3500",
      "2阶（600经验）:血量3500--5000",
      "3阶（1000经验）:血量5000--6500",
      "4阶（1600经验）:血量6500--8000",
      "5阶（3000经验）:获得自回血（200/s），为全队增加一次200血量的护盾，每三分钟重置一次",
    ],
  },
  /*
  {
    "id": 4,
    "name": "土豆雷（雷）",
    "description": "万象天引",
    "features": [
      "0阶：当本行无非盲盒目标时，每10s在全行内随机一格释放瞬爆雷；\r当本行存在非盲盒目标时，雷优先索敌最本行最前方的非盲盒目标，伤害350。\r本体被啃食连残血后出土爆炸，伤害1800（可复活一次）",
      "1阶(750经验)：伤害350→370",
      "2阶(2250经验)：伤害370→400",
      "3阶(7500经验)：伤害400→450",
      "4阶(45000经验)：攻击间隔10s→5s",
      "5阶(100000经验)：瞬爆雷伤害×1.5倍，并吸引瞬爆雷和土豆雷自身左右1.5格范围内的僵尸到瞬爆雷处爆炸。",
    ],
  },*/
  {
    "id":5,
    "name":"寒冰射手（寒）",
    "description": "霜寒离神",
    "features":[
      "0阶：原版攻速。一轮发射1枚子弹，90%发射1颗冰豆；10%概率发射一枚冰锥。\r冰豆：伤害20；为僵尸增加1层寒意。\r冰锥：伤害60；最高穿透5个目标；为有寒意目标增加1层寒意，无寒意目标增加3层寒意。",
      "1阶(3000经验):冰锥概率10%→20%",
      "2阶(9000经验):一轮1枚子弹→2枚",
      "3阶(15000经验):冰锥伤害60→80",
      "4阶(25000经验):冰锥必定冰冻第一个目标；冰锥穿透冰冻目标不消耗穿透次数",
      "5阶(45000经验):冰锥最高穿透5个目标→8个；冰锥会冰冻第三个目标左右半格的僵尸。  ",
    ]
  },
  {
    "id":6,
    "name":"大嘴花（嘴）",
    "description": "暴食饕餮",
    "features":[
      "0阶：大嘴花可以成长，初始攻击距离140像素(从大嘴格子中心算起，本格0.5格+前方1.25格)，当前方存在僵尸啃咬植物时，额外增加60像素。\r撕咬伤害40，撕咬间隔1.06s。\r受到巨人攻击时，扣除500血；受到冰车碾压时，扣除300血并击退冰车。\r初始0级咀嚼时间同原版，每吃下一次，提升1级，提高血量上限150，攻击距离增加10像素(1格80像素)，咀嚼速度-2s。\r等级上限5级。每消化一次僵尸，回复150血量。\r啃咬无法吞噬的僵尸时一次回复150血。",
      "1阶(1500经验)：撕咬伤害40→60",
      "2阶(4500经验)：等级上限5级→10级",
      "3阶(7500经验)：撕咬伤害60→80",
      "4阶(12000经验)：等级上限10级→18级(满级攻击距离0.5+3.5格，咀嚼时间为6.34s)",
      "5阶(22500经验)：撕咬无法吞噬的僵尸时有5%概率秒杀僵尸(处于无敌状态下的僵尸无法被秒杀)。",
    ]
  },
  {
    "id":7,
    "name":"双发射手（双）",
    "description":"混伤异能",
    "features":[
      "0阶：原版攻速；发射两枚子弹，可能为红(110伤害)、橙（炎）、黄（火）火焰豌豆、冰豆或普通豌豆（普豌概率为46%，其余子弹平分剩余概率）",
      "1阶(3000经验)：攻击间隔1.5s→1.4s",
      "2阶(9000经验)：普通豌豆概率减为36%",
      "3阶(15000经验)：攻击间隔1.4→1.3s",
      "4阶(24000经验)：普通豌豆概率减为22%",
      "5阶(45000经验)：可发射更多火焰豌豆(+冰火/冰炎)，所有豌豆出现概率一致。",
    ]
  },
  {
    "id": 8,
    "name": "小喷菇（小）",
    "description": "少名针妙丸",
    "features": [
        "0阶：低矮植物。攻击间隔1.8s，子弹随机造成1-10倍伤害(基础伤害20)，攻击距离7格",
        "1阶(3000经验)：攻击间隔1.8s→1.7s",
        "2阶(9000经验)：小孢子基础伤害20→22",
        "3阶(15000经验)：攻击间隔1.7s→1.5s",
        "4阶(24000经验)：小孢子基础伤害22→25",
        "5阶(45000经验)：随机倍率改为5-14倍"
    ]
  },
  {
    "id": 9,
    "name": "阳光菇（阳）",
    "description": "天基星芒",
    "features": [
        "0阶：低矮植物。蓄力阳光炮并发射，对左右共1格范围内的僵尸造成伤害。\r每4s蓄力一层，在之前层数的伤害基础上增加伤害(2%血量上限*当前层数+50伤害)，上限4层。\r索敌分为主动索敌和被动索敌：主动索敌除魅惑外的所有僵尸，蓄满发射，且不会索敌血量低于50的僵尸；\r被动索敌靠近的僵尸，立刻发射，且不会索敌血量低于20的僵尸。\r百分比伤害无视限伤。",
        "1阶(1000经验)：蓄力速度4s→3.5s",
        "2阶(2000经验)：蓄力速度3.5s→3s",
        "3阶(8000经验)：蓄力速度3s→2s",
        "4阶(50000经验)：蓄力上限4层→8层",
        "5阶(125000经验)：满阶时依然参与经验分配，每获得2000经验，立刻蓄力一层。"
    ]
  },
  {
    "id": 10,
    "name": "大喷菇（喷）",
    "description": "永远的神",
    "features": [
        "0阶：1.3s发射1次攻击距离为整行的穿透孢子(不包括身后)，对穿透的僵尸造成20伤害。",
        "1阶(2500经验)：攻击间隔1.3s→1s",
        "2阶(7500经验)：300血→400血",
        "3阶(20000经验)：伤害20→30；大喷攻击时会对前方一格范围的僵尸造成小幅击退。",
        "4阶(50000经验)：伤害30→35",
        "5阶(100000经验)：僵尸距离大喷菇越远，孢子伤害越高，最高时为1.5倍伤害(距离10格)。"
    ]
  },
  /*
  {
    "id": 12,
    "name": "魅惑菇（魅）",
    "description": "千面魂灵",
    "features": [
        "0阶：每40s召唤一个魅惑盲盒僵尸(魅惑池子不开精英和矿工)，魅惑菇本体被啃咬时魅惑僵尸，可以魅惑僵尸5次。",
        "1阶(2000经验)：本体魅惑次数5→7",
        "2阶(6000经验)：召唤cd40s→35s",
        "3阶(10000经验)：本体魅惑次数7→10",
        "4阶(16000经验)：召唤cd35s→30s",
        "5阶(30000经验)：尚未完成"
    ]
  },
  */
  {
    "id": 13,
    "name": "胆小菇（胆）",
    "description": "蕾米莉亚·威严满满·抱头蹲防·斯卡雷特",
    "features": [
        "0阶：初始攻击间隔2.2s，若持续攻击则每次攻击降低攻击间隔0.05s，最低可降至0.3s。\r不攻击时每1s增加攻击间隔0.1s直至恢复至初始攻击间隔。\r周围有僵尸时蹲下，蹲下时重置攻速。攻速叠满时，不会因为害怕蹲下。",
        "1阶(3000经验)：初始攻击间隔2.2s→2.0s",
        "2阶(9000经验)：子弹基础伤害20→22",
        "3阶(15000经验)：初始攻击间隔2.0s→1.5s",
        "4阶(24000经验)：子弹基础伤害22→25",
        "5阶(45000经验)：恢复原始间隔速度0.03s→0.01s。且子弹伤害额外增加，增加量为自身上场起击杀僵尸总数/4。向下取整，最高增加60点伤害。"
    ]
  },
  {
    "id": 14,
    "name": "冰川菇（川）",
    "description": "冰冻三尺",
    "features": [
        "0阶：每9s为本行所有僵尸叠加1层寒意。有60%概率为本行最左的三只僵尸额外叠加1层寒意。",
        "1阶(1000经验)：血量300→500",
        "2阶(3000经验)：cd 9s→7.5s；额外寒意概率60%→70%",
        "3阶(5000经验)：血量500→700",
        "4阶(8000经验)：cd 7.5s→6s；额外寒意概率70%→80%",
        "5阶(15000经验)：所有僵尸叠加1层→2层；叠加时，若僵尸已拥有5层寒意，则有20%冻结僵尸。本行冻结解冻时扣除10%的血量。"
    ]
  },
  {
    "id": 18,
    "name": "三线豌豆射手（三）",
    "description": "广域打击",
    "features": [
        "0阶：1.5攻速每轮发射6颗豌豆，其中四发子弹呈正弦函数运动，另外两发直线向前。每次攻击有？%概率开大（与二代装扮大招一致，共220豆），开大后下次开大概率？%，最高？%。开大时处于无敌状态并回满血量。",
        "1阶(3000经验)：攻击间隔1.5s→1.4s",
        "2阶(9000经验)：最大概率？%→？%",
        "3阶(15000经验)：攻击间隔1.4s→1.3s",
        "4阶(24000经验)：最大概率？%→？%",
        "5阶(45000经验)：？"
    ]
  },
  {
    "id": 19,
    "name": "缠绕海草（草）",
    "description": "深陷泥潭",
    "features": [
        "0阶：自身不会被僵尸啃咬、车类碾压、巨人砸。\r缠绕右方3格内的一个敌人（硬控，僵尸无法移动，但巨人砸击仍然生效）并放毒造成伤害(1s叠加1层，每一层增加6/s伤害)，上限40层。\r杀死僵尸后，重新控制新目标(cd3s)。",
        "1阶(1000经验)：缠绕范围3格→5格",
        "2阶(3000经验)：毒伤(1层/s→2层/s)",
        "3阶(5000经验)：缠绕范围5格→8格",
        "4阶(8000经验)：毒伤(2层/s→3层/s)",
        "5阶(15000经验)：控制新目标cd变为1s"
    ]
  },
  {
    "id": 22,
    "name": "火炬树桩（火）",
    "description": "霜火长明",
    "features": [
        "0阶：可使豌豆类子弹淬火变成火豆，火豆可以二次淬火变炎豆，淬火概率为25%。会使冰豆变成普通豌豆(100%)。火豆伤害40，炎豆伤害80，溅射衰减。",
        "1阶(2000经验)：血量300→450",
        "2阶(6000经验)：淬火概率25%→50%",
        "3阶(10000经验)：血量450→600",
        "4阶(16000经验)：淬火概率50%→100%",
        "5阶(30000经验)：火炬变为冰火炬，可以使豌豆/冰豆变为冰火豆(40伤，溅射减速，溅射衰减)、冰火豆/火豆变为冰炎豆(80伤，溅射减速，溅射衰减)。"
    ]
  },
  /*
  {
    "id":28,
    "name":"裂荚射手（裂）",
    "description":"意念豆回归",
    "features":[
      "0阶：前2后2，射速1.5s，一个意念豆，意念豆同S5，碰到僵尸反弹",
      "1阶(3000经验)：意念豆+1",
      "2阶(9000经验)：意念豆击中僵尸10%向左平移一格",
      "3阶(15000经验)：滚木",
      "4阶(25000经验)：意念豆+1",
      "5阶(45000经验)：意念豆有15%概率穿透一个敌人（仅向右）",
    ]
  },
  */
  {
    "id":41,
    "name":"冰冻生菜（菜）",
    "description":"霜华漫天",
    "features":[
      "0阶：每15秒在距离家门最近的一只僵尸脚下生成一枚冰冻生菜，被啃咬时触发，造成单体被冰冻5秒，解冻后附加1层寒意",
      "1阶：15秒加速至14秒 冰冻时间延长至6秒",
      "2阶：14秒加速至13秒 冰冻时间延长至7秒",
      "3阶：13秒加速至12秒 冰冻时间延长至8秒",
      "4阶：12秒加速至11秒 冰冻时间延长至9秒",
      "5阶：11秒加速至10秒 冰冻时间延长至10秒 冰冻对象升为一整格",
    ]
  }
]
